# --------------------------------------------------------------
# 반복문 - 2 while 반복문
# - 반복의 횟수가 정해진 경우 사용 가능함
# --------------------------------------------------------------
# [요청] 사용자가 알고 싶어하는 단을 입력 받아서 해당 단의 구구단 출력하기
#       단, while 반복문 사용하기
# [예시] 알고 싶은 단 입력: 3
#       --3단--
#       3 * 1 =3
#       3 * 2 =6
#       3 * 3 =9
#       3 * 4 =12
#        ......
# --------------------------------------------------------------
if False:
    num = int(input("알고 싶은 단 입력 : "))
    cnt = 1
    print(f"{num:-^9}단")
    while cnt<10:
        print(f'{num} * {cnt} = {num*cnt:2}')
        cnt += 1

# [요청] 2~9단 출력, 단 while 반복문 사용
#       단, while 반복문 사용하기
#       --2단--
#       2 * 1 =2
#       2 * 2 =4
#       2 * 3 =6
#       2 * 4 =8
#        ......

#       --3단--
#       3 * 1 =3
#       3 * 2 =6
#       3 * 3 =9
#       3 * 4 =12
#        ......
# --------------------------------------------------------------
num = 2
while num<10:
    print(f'{num:-^9}단')
    cnt=1
    while cnt < 10:
        print(f'{num} * {cnt} = {num * cnt:2}')
        cnt += 1
    num += 1