# -------------------------------------------------------------------
# 다양한 함수의 형태 - (3) return 키워드
# - 함수 호출한 곳으로 돌아가게 하는 기능
#   결과값이 함께 있다면 결과값을 가지고 돌아감
#
# - 함수 생성 문법
#   def 함수이름(매개변수1, 매개변수2, ..., 매개변수):
#       조건 코드와 return
#       실행코드
#       실행코드
#       return 결과값
# -------------------------------------------------------------------
# 함수 기능 : 팩토리얼을 계산 후 계산 결과를 반환해주는 기능
# 함수 이름 : facT_Orial
# 매개 변수 : x
# 반 환 값 : 계산 결과
# -------------------------------------------------------------------
def facT_Orial(x):
    if not x:
        return 1
    result = 1      # 결과 저장 변수
    if x:
        for i in range(x, 0, -1):
            result *= i
    return result

print(f'0! => {facT_Orial(0)}')
print(f'3! => {facT_Orial(3)}')
