# -------------------------------------------------------------------
# 다양한 함수의 형태 - 특별한 함수 (2)
# - 매개변수의 갯수를 유동적으로 가변으로 하는 함수
# - 키와 값의 덩어리 데어리 데이터
# - 형태 : def 함수명( **data ):
# - 가변 인자 함수
# - 매개변수 개수 : 0 ~ N개
# - 호출 : 함수명(키1=값1)
#         함수명(키1=값1, 키2=값2, 키3=값3)
#         함수명()
# -------------------------------------------------------------------
aDict={'name':'Hong', 'age':10}
aDict.update(job="학생")
aDict.update(job="학생", birth='1004', blood='O')

print(aDict)
aDict.update(점수1=100, 점수2=90, 점수3=80)
print(aDict)

def test(name, age, addr):
    print(name, age, addr)

test('hong', 12, 'daegu')
