# [실습1]------------------------------------------------
# 좋아하는 정수를 하나 저장한 후 짝수면 '짝수입니다'
# 홀수면 '홀수입니다'를 출력해 주세요
# ------------------------------------------------------
myNums = 8

# 숫자 % 2 == 0 : 짝수, 숫자 % 2 == 1 : 홀수
if myNums%2 == 0:
    print(myNums, "짝수입니다.")
else:
    print(myNums, "홀수입니다.")

if myNums%2:
    print(myNums, "홀수입니다.")
else:
    print(myNums, "짝수입니다.")


# [실습2]------------------------------------------------
# 좋아하는 정수를 하나 저장한 후 양수면 'OO은 양수입니다'
# 음수면 'OO은 음수입니다'
# 0이면 'OO은 영입니다' 출력해 주세요
# ------------------------------------------------------
# 다중 조건문 => 조건문이 2개 이상 되는 경우
if myNums>0:
    print(f'{myNums} 양수')
elif myNums<0:
    print(f'{myNums} 음수')
else:
    print(f'{myNums} 영(Zero)')

# [실습2]------------------------------------------------
# 좋아하는 정수를 하나 저장한 후 양수면 'OO은 양수입니다'
# 음수면 'OO은 음수입니다'
# 0이면 'OO은 영입니다' 출력해 주세요
# ------------------------------------------------------
# 중첩 조건문 => 조건문 안에 조건문이 존재하는 경우
if myNums==0:
    print(f'{myNums} == Zero')
else:
    if myNums>0:
        print(f'{myNums} 양수')
    else:
        print(f'{myNums} 음수')

if myNums:
    if myNums>0:
        print(f'{myNums} 양수')
    else:
        print(f'{myNums} 음수')
else:
    print(f'{myNums} Zero')