# ------------------------------------------------------------
# [실습1] 단어를 입력 받은 후 아래 코드를 작성하세요.
# - 입력 받은 단어가 알파벳만으로 구성되어 있는지 검사
# - 입력 받은 단어가 숫자만으로 구성되어 있는지 검사
# - 입력 받은 단어가 모두 대문자로만 구성되어 있는지 검사
# - 입력 받은 단어가 모두 소문자로만 구성되어 있는지 검사
# ------------------------------------------------------------
word = input("단어 입력 : ")   # str 타입

print(f'{word} 알파벳만 검사 =>  {word.isalpha()}')
print(f'{word} 숫자만 검사 => {word.isnumeric()}')
print(f'{word} 모두 대문자인지 검사 => {word.isupper()}')
print(f'{word} 모두 소문자인지 검사 => {word.islower()}')


# ------------------------------------------------------------
# [실습2] 파일명을 입력 받은 후 아래 코드를 작성하세요. => str 전용 함수인 메서드 활용
# - 입력 받은 파일이 text 파일인지 검사  ==> 확장자 text
# - 입력 받은 파일이 jpg 파일인지 검사   ==> 확장자 jpg
# - 입력 받은 파일이 py 파일인지 검사    ==> 확장자 py
# ------------------------------------------------------------
sentence = input("파일명 입력 : ")

print(f'{sentence} text 검사 =>  {sentence.endswith("txt")}')
print(f'{sentence} jpg 검사 => {sentence.endswith("jpg")}')
print(f'{sentence} py 검사 => {sentence.endswith("py")}')
