# --------------------------------------------------------------
# [실습1] 알고 싶은 단을 입력 받고 해당 단을 출력해 주세요.
# - input()
# - 특정 단의 구구단을 출력 => 반복문 사용하기
# --------------------------------------------------------------
nums = input("몇 단?: ")
if nums:
    # 숫자로만 구성되어 있는지
    if nums.isdecimal():
        nums=int(nums)
        for i in range(9,0,-1):
            print(f'{nums}X{i} = {nums*i}')
else:
    print("입력된 데이터가 없습니다.")

# --------------------------------------------------------------
# [실습2] 2단~9단까지 모두 출력 하세요. 반복문 사용하기!!
# - 중첩 for 반복문
# --------------------------------------------------------------
for i in range(2,10):
    print(f'----{i}단----')
    for n in range(1,10):
        print(f'{i}X{n} = {i*n}')

# --------------------------------------------------------------
# [실습3] 2단~9단까지 모두 출력 하세요. 반복문 사용하기!!
# - 중첩 for 반복문
# --------------------------------------------------------------
# i = 1 ~ 9
for i in range(1,10):
    for n in range(2,10):
        if n:
            print(f'{n}X{i} = {n*i:<2}',end="\n" if n == 9 else '   ')
        else:
            print(f'----{n}단-----', end="\n" if n == 9 else '   ')